thesis/listings/streaming-message-describe.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:stream="https://github.com/autermann/streaming-wps">
  <soap:Header>
    <wsa:MessageID>uuid:9ca0ed4a-0e24-4843-bb81-da2af3e23d8c</wsa:MessageID>
    <wsa:Action>https://github.com/autermann/streaming-wps/describe</wsa:Action>
  </soap:Header>
  <soap:Body>
    <stream:DescribeMessage>
      <stream:ProcessID>uuid:c99e6f21-f0a0-4770-9615-db3501490f0a</stream:ProcessID>
    </stream:DescribeMessage>
  </soap:Body>
</soap:Envelope>